application/deployment/benchmarking/test-4threads-4connections-1service-10mins.txt
Running 10m test @ http://0.0.0.0:9000/products/1
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.501ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.545ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.503ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.359ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.17ms   90.27ms   1.25s    96.45%
    Req/Sec   264.39    107.98     1.89k    94.01%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.49ms
 75.000%    1.75ms
 90.000%    2.09ms
 99.000%  536.06ms
 99.900%    1.01s
 99.990%    1.18s
 99.999%    1.23s
100.000%    1.25s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.577     0.000000            1         1.00
       0.992     0.100000        59252         1.11
       1.151     0.200000       118362         1.25
       1.276     0.300000       177373         1.43
       1.388     0.400000       236311         1.67
       1.494     0.500000       295504         2.00
       1.545     0.550000       324809         2.22
       1.595     0.600000       354243         2.50
       1.646     0.650000       383900         2.86
       1.698     0.700000       413273         3.33
       1.755     0.750000       442854         4.00
       1.787     0.775000       457447         4.44
       1.823     0.800000       472222         5.00
       1.864     0.825000       486777         5.71
       1.916     0.850000       501687         6.67
       1.984     0.875000       516252         8.00
       2.030     0.887500       523686         8.89
       2.091     0.900000       531160        10.00
       2.185     0.912500       538385        11.43
       2.445     0.925000       545769        13.33
       3.407     0.937500       553122        16.00
       6.959     0.943750       556809        17.78
      23.903     0.950000       560498        20.00
      51.103     0.956250       564188        22.86
      90.559     0.962500       567876        26.67
     149.631     0.968750       571563        32.00
     187.775     0.971875       573403        35.56
     234.879     0.975000       575248        40.00
     289.279     0.978125       577096        45.71
     345.855     0.981250       578938        53.33
     404.223     0.984375       580779        64.00
     437.503     0.985938       581703        71.11
     471.807     0.987500       582627        80.00
     509.183     0.989062       583552        91.43
     553.983     0.990625       584475       106.67
     606.719     0.992188       585390       128.00
     638.463     0.992969       585851       142.22
     668.671     0.993750       586310       160.00
     698.367     0.994531       586776       182.86
     730.111     0.995313       587238       213.33
     762.367     0.996094       587695       256.00
     779.263     0.996484       587924       284.44
     798.207     0.996875       588158       320.00
     819.199     0.997266       588383       365.71
     844.799     0.997656       588615       426.67
     885.759     0.998047       588844       512.00
     906.751     0.998242       588960       568.89
     931.327     0.998437       589077       640.00
     953.855     0.998633       589190       731.43
     985.087     0.998828       589305       853.33
    1014.271     0.999023       589423      1024.00
    1029.119     0.999121       589481      1137.78
    1041.407     0.999219       589536      1280.00
    1055.743     0.999316       589593      1462.86
    1072.127     0.999414       589653      1706.67
    1088.511     0.999512       589709      2048.00
    1096.703     0.999561       589738      2275.56
    1105.919     0.999609       589769      2560.00
    1114.111     0.999658       589796      2925.71
    1126.399     0.999707       589825      3413.33
    1136.639     0.999756       589852      4096.00
    1142.783     0.999780       589868      4551.11
    1147.903     0.999805       589882      5120.00
    1155.071     0.999829       589898      5851.43
    1162.239     0.999854       589911      6826.67
    1170.431     0.999878       589924      8192.00
    1174.527     0.999890       589932      9102.22
    1179.647     0.999902       589939     10240.00
    1183.743     0.999915       589949     11702.86
    1186.815     0.999927       589953     13653.33
    1191.935     0.999939       589961     16384.00
    1195.007     0.999945       589965     18204.44
    1197.055     0.999951       589969     20480.00
    1199.103     0.999957       589971     23405.71
    1202.175     0.999963       589975     27306.67
    1206.271     0.999969       589978     32768.00
    1208.319     0.999973       589980     36408.89
    1211.391     0.999976       589982     40960.00
    1214.463     0.999979       589984     46811.43
    1218.559     0.999982       589986     54613.33
    1221.631     0.999985       589987     65536.00
    1224.703     0.999986       589988     72817.78
    1226.751     0.999988       589989     81920.00
    1229.823     0.999989       589990     93622.86
    1232.895     0.999991       589991    109226.67
    1235.967     0.999992       589992    131072.00
    1235.967     0.999993       589992    145635.56
    1238.015     0.999994       589993    163840.00
    1238.015     0.999995       589993    187245.71
    1241.087     0.999995       589994    218453.33
    1241.087     0.999996       589994    262144.00
    1241.087     0.999997       589994    291271.11
    1243.135     0.999997       589995    327680.00
    1243.135     0.999997       589995    374491.43
    1243.135     0.999998       589995    436906.67
    1243.135     0.999998       589995    524288.00
    1243.135     0.999998       589995    582542.22
    1246.207     0.999998       589996    655360.00
    1246.207     1.000000       589996          inf
#[Mean    =       17.170, StdDeviation   =       90.271]
#[Max     =     1245.184, Total count    =       589996]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  600004 requests in 10.00m, 101.28MB read
Requests/sec:   1000.00
Transfer/sec:    172.85KB