application/deployment/benchmarking/test-4threads-4connections-1service-5mins.txt
Running 5m test @ http://0.0.0.0:9000/products/1
  4 threads and 4 connections
  Thread calibration: mean lat.: 5.888ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.982ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.488ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.858ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.44ms   28.22ms 566.78ms   98.45%
    Req/Sec   263.96     78.46     1.60k    97.02%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.57ms
 75.000%    1.79ms
 90.000%    2.03ms
 99.000%   81.60ms
 99.900%  446.46ms
 99.990%  529.41ms
 99.999%  562.69ms
100.000%  567.29ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.592     0.000000            1         1.00
       1.046     0.100000        29047         1.11
       1.234     0.200000        58055         1.25
       1.368     0.300000        87110         1.43
       1.475     0.400000       116167         1.67
       1.568     0.500000       145104         2.00
       1.612     0.550000       159649         2.22
       1.656     0.600000       174175         2.50
       1.700     0.650000       188748         2.86
       1.745     0.700000       203151         3.33
       1.795     0.750000       217687         4.00
       1.823     0.775000       224939         4.44
       1.853     0.800000       232126         5.00
       1.886     0.825000       239387         5.71
       1.924     0.850000       246518         6.67
       1.971     0.875000       253788         8.00
       1.998     0.887500       257384         8.89
       2.030     0.900000       261031        10.00
       2.069     0.912500       264671        11.43
       2.119     0.925000       268251        13.33
       2.193     0.937500       271918        16.00
       2.245     0.943750       273729        17.78
       2.331     0.950000       275520        20.00
       2.499     0.956250       277316        22.86
       2.785     0.962500       279122        26.67
       3.191     0.968750       280941        32.00
       3.993     0.971875       281840        35.56
       5.571     0.975000       282748        40.00
       8.519     0.978125       283655        45.71
      17.263     0.981250       284559        53.33
      31.935     0.984375       285465        64.00
      42.047     0.985938       285918        71.11
      53.759     0.987500       286372        80.00
      68.095     0.989062       286825        91.43
      92.287     0.990625       287278       106.67
     123.967     0.992188       287731       128.00
     144.767     0.992969       287957       142.22
     167.295     0.993750       288184       160.00
     195.327     0.994531       288411       182.86
     233.983     0.995313       288637       213.33
     278.527     0.996094       288864       256.00
     299.007     0.996484       288978       284.44
     322.815     0.996875       289091       320.00
     346.111     0.997266       289205       365.71
     368.127     0.997656       289317       426.67
     389.631     0.998047       289430       512.00
     401.151     0.998242       289488       568.89
     410.367     0.998437       289543       640.00
     423.167     0.998633       289602       731.43
     435.967     0.998828       289657       853.33
     448.255     0.999023       289714      1024.00
     454.655     0.999121       289742      1137.78
     461.567     0.999219       289770      1280.00
     470.271     0.999316       289798      1462.86
     479.487     0.999414       289828      1706.67
     488.447     0.999512       289856      2048.00
     492.287     0.999561       289870      2275.56
     496.127     0.999609       289883      2560.00
     499.967     0.999658       289897      2925.71
     504.575     0.999707       289913      3413.33
     508.927     0.999756       289927      4096.00
     510.975     0.999780       289933      4551.11
     514.047     0.999805       289940      5120.00
     517.887     0.999829       289947      5851.43
     522.495     0.999854       289954      6826.67
     526.335     0.999878       289962      8192.00
     528.895     0.999890       289966      9102.22
     530.943     0.999902       289968     10240.00
     533.503     0.999915       289972     11702.86
     536.575     0.999927       289975     13653.33
     541.695     0.999939       289979     16384.00
     544.767     0.999945       289982     18204.44
     544.767     0.999951       289982     20480.00
     547.839     0.999957       289984     23405.71
     550.911     0.999963       289986     27306.67
     553.983     0.999969       289988     32768.00
     556.543     0.999973       289989     36408.89
     556.543     0.999976       289989     40960.00
     557.055     0.999979       289990     46811.43
     560.127     0.999982       289992     54613.33
     560.127     0.999985       289992     65536.00
     562.687     0.999986       289994     72817.78
     562.687     0.999988       289994     81920.00
     562.687     0.999989       289994     93622.86
     562.687     0.999991       289994    109226.67
     562.687     0.999992       289994    131072.00
     564.735     0.999993       289995    145635.56
     564.735     0.999994       289995    163840.00
     564.735     0.999995       289995    187245.71
     564.735     0.999995       289995    218453.33
     564.735     0.999996       289995    262144.00
     567.295     0.999997       289996    291271.11
     567.295     1.000000       289996          inf
#[Mean    =        4.444, StdDeviation   =       28.225]
#[Max     =      566.784, Total count    =       289996]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  300004 requests in 5.00m, 50.64MB read
Requests/sec:   1000.01
Transfer/sec:    172.85KB